Pre-Processing/1_cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1; //Scale coordinates

vertices
(
    (0 0 0)   //vertex 0
    (1 0 0)   //vertex 1
    (1 1 0)   //vertex 2
    (0 1 0)   //vertex 3  // Try this (0 1 0.1) //vertex 7 and see error
    (0 0 0.1) //vertex 4
    (1 0 0.1) //vertex 5
    (1 1 0.1) //vertex 6
    (0 1 0.1) //vertex 7
);

blocks
( //Definition of the hexahedral block. Pay attention to the numbering.
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1) //Uniform gradient
);  
    //20 cells in x-direction, 20 cells in y-direction, 
    //and only 1 cell in z-direction bcs the simulation will be 2D. 
    
edges //This is simple geometry, edges can be empty.
(
);
boundary //Definition of boundary of the domain to apply the BC.
(
    movingWall
    {
        type wall;
        faces
        (
           (3 7 6 2)   //Try (6 2 3 7),it is also okay. 
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty; // Faces normal to Oz are "empty" to specify that the simulation is 2D.
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
